Tekla Open API Reference for Tekla Structures 2025
AnalysisObjectPicker.PickObjectType Enumeration
 The possible pick object types.
 Namespace: Tekla.Structures.Analysis.UI
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum PickObjectType
Public Enumeration PickObjectType
Members
Member name | Value | Description
AnalysisObject | 0 |  Any analysis object.
AnalysisPart | 1 |  Analysis part object.
AnalysisNode | 2 |  Analysis node object.
AnalysisNodeLink | 3 |  Analysis node link object.
See Also
Reference
Tekla.Structures.Analysis.UI Namespace